{"pageProps":{"post":{"type_of":"article","id":636046,"title":"The Shocking Immaturity of JavaScript","description":"Do code newbies realize just how shockingly buggy and incomplete all the tools they use really are?","readable_publish_date":"Mar 16","slug":"the-shocking-immaturity-of-javascript-c70","path":"/jaredcwhite/the-shocking-immaturity-of-javascript-c70","url":"https://dev.to/jaredcwhite/the-shocking-immaturity-of-javascript-c70","comments_count":160,"public_reactions_count":344,"collection_id":null,"published_timestamp":"2021-03-16T01:45:53Z","positive_reactions_count":344,"cover_image":"https://res.cloudinary.com/practicaldev/image/fetch/s--VImsvjBZ--/c_imagga_scale,f_auto,fl_progressive,h_420,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/pd5d1n04lgg2jcrtqwz4.jpg","social_image":"https://res.cloudinary.com/practicaldev/image/fetch/s--NRaD4tYO--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/pd5d1n04lgg2jcrtqwz4.jpg","canonical_url":"https://dev.to/jaredcwhite/the-shocking-immaturity-of-javascript-c70","created_at":"2021-03-16T00:31:21Z","edited_at":"2021-03-16T15:24:10Z","crossposted_at":null,"published_at":"2021-03-16T01:45:53Z","last_comment_at":"2021-11-19T04:41:11Z","reading_time_minutes":6,"tag_list":["javascript","codenewbie","beginners"],"tags":["javascript","codenewbie","beginners"],"body_html":"<p>This is going to come across as a rant, so I'll do my best to refrain from blaming any one project or source and just make a generalized statement.</p>\n\n<p><strong>The ecosystem of JavaScript frameworks is almost unbelievably unstable.</strong> Yes, even now in the year 2021.</p>\n\n<p>From backend ORMs and headless APIs to frontend site generators, package managers, and build tools—it's a miracle any of it actually works properly in production!</p>\n\n<p>Some weeks I spend literally <em>hours</em> debugging and researching all kinds of weird, arcane bugs or conceptual hurdles related to performance, hosting, payload sizes, full-stack architectural gotchas, and the list goes on and on and on. And it's not just me. I'm on a team that is in a constant mode of struggle and churn due to dealing with largely obvious issues related to the most popular tools for backend &amp; frontend JavaScript (at least according to their massive star counts on GitHub).</p>\n\n<p>Now the reason this really grinds my gears isn't just related to my particular project. In a purely cynical sense, what do I care? I'm getting paid the same whether I'm writing code or debugging it.</p>\n\n<p>The thing that bothers me is how awful of an experience this is for people with <em>far</em> less experience than me. I've been in this industry for over 20 years. However, other people are attempting to get into web development <strong>this year</strong>. And they're being told in order to do so they have to learn X, Y, and Z tools…all JavaScript of course. The problem is if they run into major issues—and they do, believe me, they do—they don't know enough to grasp just how buggy and incomplete the tooling is. Instead, they think they must have just made a mistake, or simply haven't learned enough yet. The cognitive load required is staggering.</p>\n\n<p>Or perhaps they haven't run into too many issues yet. (Lucky!) That's possible, because <em>the vast majority</em> of tutorials and examples out there for the top JavaScript frameworks are laughably simplistic. If I see yet another example of how to use a GraphQL query to pull a blog post from a headless CMS to statically render an article using a component tree built with You-Know-What.js, I'm going to rip my hair out of my skull. This isn't where any real-world applications of any reasonable size get tripped up. The devil is <em>always</em> in the details. The problems typically arise well beyond the scope of clickbait-y \"Build THIS in 10 minutes\" articles.</p>\n\n<h3>\n  <a name=\"how-do-we-fix-this\" href=\"#how-do-we-fix-this\" class=\"anchor\">\n  </a>\n  How Do We Fix This?\n</h3>\n\n<p>The path to correcting any sort of systemic problem is to first acknowledge it and then to define its scope with honest and sober reflection.</p>\n\n<p>We all need to start being forthcoming about just how shockingly buggy and incomplete most of the JavaScript tooling is across the board. <em>Compared to what</em>, you might ask? Maybe this is just an artifact of web development, period. It's the nature of the beast.</p>\n\n<p><strong>Wrong.</strong> You can hop the fence over to other programming languages, frameworks, and ecosystems, and discover that the tooling there is <strong>far more stable and usable</strong> over the long haul. I don't wish to turn this into a pitch for Ruby, but let's just say in my many years of <em>extensive engagement</em> with the Rails framework and related projects, I've never encountered the sheer volume of bugs, glitches, gotchas, and limitations which I encounter <em>on a regular basis</em> in JS land. And it's not just me…I'm in chat rooms and Twitter threads all the time where other folks are losing their minds over some latest craziness. All we can do is shake our heads and go take a walk or something to relieve the pressure.</p>\n\n<p>So how do we fix this? Here's one suggestion:</p>\n\n<h3>\n  <a name=\"start-telling-the-truth\" href=\"#start-telling-the-truth\" class=\"anchor\">\n  </a>\n  Start Telling the Truth\n</h3>\n\n<p>Get off the off-the-charts hype machine, stat. Enough with hyperbolic statements like \"this is the modern way to build the web\" or \"this gives you the best developer experience with all the features you need for production\" or \"write high quality, loosely coupled, scalable, maintainable applications the most productive way\". (These are all real quotes, BTW.) The constant marketing is not only exhausting, it also feeds newbies a bunch of malarkey.</p>\n\n<p>Start by being honest about what <em>doesn't</em> work as much as what does work. Warn people about building battle-hardened, production-level code on top of your buggy and incomplete foundations. Steer people towards other, better solutions—even other languages and frameworks—if you know your tool-du-jour isn't quite up to snuff yet. Slow down your progress on shiny new features and fix the features you've already shipped.</p>\n\n<p>Label releases and techniques properly. It's perfectly serviceable to have something in alpha or beta state for quite some time, or to say a particular technique is probably only suitable for the stout-hearted with time to kill. Also, stop with the \"old-school code\" shaming. The world isn't going to end if you write something in a manner that's been proven to work for several years by now, rather than the \"flavor-of-the-month\" according to some code-school blog. We snicker at one person's <code>var</code> or another person's <code>$.get</code> to fix the fire extinguisher and meanwhile the house is on fire.</p>\n\n<h3>\n  <a name=\"feel-the-users-pain\" href=\"#feel-the-users-pain\" class=\"anchor\">\n  </a>\n  Feel the Users' Pain\n</h3>\n\n<p>This all mainly boils down to something we learn in the world of UX (User Experience) design—you have to feel the pain your users go through when they use your software. In the case of developer tools, developers are the users! That's why the term DX (Developer Experience) gets thrown around a lot now. The thing is, good DX isn't just some whiz-bang <em>ooo, that's cool</em> reaction to a new blog post. It's \"how well will this work for me and my team over the next several years??!\" In that sense, the DX of the JavaScript ecosystem has a <em>lot</em> to answer for. Sometimes you even see it in GitHub issue and PR comments: rude, curt dismissals of genuine problems people are having in the real world. RTFM is <em>never</em> the correct response to DX issues.</p>\n\n<p>Again, I come from the world of Ruby—not perfect by any means. But we have a saying, MINASWAN, which stands for Matz-is-nice-and-so-we-are-nice. In other words, the creator of Ruby (known as Matz) is in most respects a pretty genteel fellow. So let's also be nice and help out our fellow developers, particularly the newbies. That doesn't just mean in terms of sharing ideas or providing education. It means <em>the tools we build should themselves be pretty nice!</em> Crappy code smell and lousy DX often gets called out in the Ruby community because we've been handed a high bar. Name your variables well. Reduce boilerplate. Use a small surface area for your API whenever possible. Cultivate well-organized codebases. Convention over configuration. Maximize programmer happiness. And so on and so forth.</p>\n\n<p>The result of all this is I sometimes look at the bugs or issues with I deal with when using JavaScript tooling and my initial reaction is: <strong>this would <em>never</em> fly in Ruby</strong>. Developers would simply laugh and quickly move on to a better tool. I'm not saying this to prop up Ruby. I'm saying this to convince you that <em>you need to demand more of your JS tools</em>.</p>\n\n<p><strong>Demand more stability.</strong></p>\n\n<p><strong>Demand more clarity.</strong></p>\n\n<p><strong>Demand more honesty and less marketing fluff.</strong></p>\n\n<p><strong>Demand higher standards.</strong> (Heck, demand standards at all! The ecosystem churn around ES modules right now is driving even the top authors of frontend bundlers absolutely nuts!)</p>\n\n<p><strong>Stop putting up with the nonsense.</strong> The excuses have run out. How long have we had Node? How long has ES6+ JavaScript been with us? How long have we had other, more stable ecosystems to be inspired by?</p>\n\n<h3>\n  <a name=\"conclusion\" href=\"#conclusion\" class=\"anchor\">\n  </a>\n  Conclusion\n</h3>\n\n<p>You might conclude, after such a rant, that I hate JavaScript and just want to leave. Actually, I don't! 😅 There are JS projects I <em>love</em> which offer great APIs in my opinion. <a href=\"https://lit-element.polymer-project.org\">LitElement</a> for example is one of the best developer tools I've ever used in any language. Native ESM support in browsers and modern CDNs like SkyPack are wildly exciting. I've actually written a Webpack plugin and found the experience enjoyable. In fact, unlike some fellow Rails devs I know, I rather like configuring Webpack. (Now who's the crazy one?!) PostCSS is a nifty Node project I benefit from every day. <a href=\"https://shoelace.style\">Shoelace web components</a> are the bees' knees.</p>\n\n<p>So I don't hate JS. I don't hate frontend engineering, and I don't hate Node. What I hate is developer tools with awful DX due to hacks upon hacks upon endless modules of widely-varying quality as a result of constant churn in \"best practices\" and what's compatible with what, where, when. I simply no longer have the patience to deal.</p>\n\n<p>Thus I'm begging you—<em>imploring you</em>—if you build or maintain any tool in the JS ecosystem, pause for a moment and consider how you can reorient yourself around upping the long-term quality level of the tools you produce. And if you are a newbie, DEMAND your tools give you the quality you deserve. And if you <em>do</em> work on a tool that's actually pretty stable, fun to work with, and hasn't tried to take over the world with ridiculous claims—<em>kudos to you!</em> <strong>You're breathing rarified air.</strong> 😜</p>\n\n","body_markdown":"Do code newbies realize just how shockingly buggy and incomplete all the tools they use really are?\ntags: js, codenewbies, beginners\ncover_image: https://dev-to-uploads.s3.amazonaws.com/uploads/articles/pd5d1n04lgg2jcrtqwz4.jpg\n---\n\nThis is going to come across as a rant, so I'll do my best to refrain from blaming any one project or source and just make a generalized statement.\n\n**The ecosystem of JavaScript frameworks is almost unbelievably unstable.** Yes, even now in the year 2021.\n\nFrom backend ORMs and headless APIs to frontend site generators, package managers, and build tools—it's a miracle any of it actually works properly in production!\n\nSome weeks I spend literally _hours_ debugging and researching all kinds of weird, arcane bugs or conceptual hurdles related to performance, hosting, payload sizes, full-stack architectural gotchas, and the list goes on and on and on. And it's not just me. I'm on a team that is in a constant mode of struggle and churn due to dealing with largely obvious issues related to the most popular tools for backend & frontend JavaScript (at least according to their massive star counts on GitHub).\n\nNow the reason this really grinds my gears isn't just related to my particular project. In a purely cynical sense, what do I care? I'm getting paid the same whether I'm writing code or debugging it.\n\nThe thing that bothers me is how awful of an experience this is for people with _far_ less experience than me. I've been in this industry for over 20 years. However, other people are attempting to get into web development **this year**. And they're being told in order to do so they have to learn X, Y, and Z tools…all JavaScript of course. The problem is if they run into major issues—and they do, believe me, they do—they don't know enough to grasp just how buggy and incomplete the tooling is. Instead, they think they must have just made a mistake, or simply haven't learned enough yet. The cognitive load required is staggering.\n\nOr perhaps they haven't run into too many issues yet. (Lucky!) That's possible, because _the vast majority_ of tutorials and examples out there for the top JavaScript frameworks are laughably simplistic. If I see yet another example of how to use a GraphQL query to pull a blog post from a headless CMS to statically render an article using a component tree built with You-Know-What.js, I'm going to rip my hair out of my skull. This isn't where any real-world applications of any reasonable size get tripped up. The devil is _always_ in the details. The problems typically arise well beyond the scope of clickbait-y \"Build THIS in 10 minutes\" articles.\n\n### How Do We Fix This?\n\nThe path to correcting any sort of systemic problem is to first acknowledge it and then to define its scope with honest and sober reflection.\n\nWe all need to start being forthcoming about just how shockingly buggy and incomplete most of the JavaScript tooling is across the board. _Compared to what_, you might ask? Maybe this is just an artifact of web development, period. It's the nature of the beast.\n\n**Wrong.** You can hop the fence over to other programming languages, frameworks, and ecosystems, and discover that the tooling there is **far more stable and usable** over the long haul. I don't wish to turn this into a pitch for Ruby, but let's just say in my many years of _extensive engagement_ with the Rails framework and related projects, I've never encountered the sheer volume of bugs, glitches, gotchas, and limitations which I encounter _on a regular basis_ in JS land. And it's not just me…I'm in chat rooms and Twitter threads all the time where other folks are losing their minds over some latest craziness. All we can do is shake our heads and go take a walk or something to relieve the pressure.\n\nSo how do we fix this? Here's one suggestion:\n\n### Start Telling the Truth\n\nGet off the off-the-charts hype machine, stat. Enough with hyperbolic statements like \"this is the modern way to build the web\" or \"this gives you the best developer experience with all the features you need for production\" or \"write high quality, loosely coupled, scalable, maintainable applications the most productive way\". (These are all real quotes, BTW.) The constant marketing is not only exhausting, it also feeds newbies a bunch of malarkey.\n\nStart by being honest about what *doesn't* work as much as what does work. Warn people about building battle-hardened, production-level code on top of your buggy and incomplete foundations. Steer people towards other, better solutions—even other languages and frameworks—if you know your tool-du-jour isn't quite up to snuff yet. Slow down your progress on shiny new features and fix the features you've already shipped.\n\nLabel releases and techniques properly. It's perfectly serviceable to have something in alpha or beta state for quite some time, or to say a particular technique is probably only suitable for the stout-hearted with time to kill. Also, stop with the \"old-school code\" shaming. The world isn't going to end if you write something in a manner that's been proven to work for several years by now, rather than the \"flavor-of-the-month\" according to some code-school blog. We snicker at one person's `var` or another person's `$.get` to fix the fire extinguisher and meanwhile the house is on fire.\n\n### Feel the Users' Pain\n\nThis all mainly boils down to something we learn in the world of UX (User Experience) design—you have to feel the pain your users go through when they use your software. In the case of developer tools, developers are the users! That's why the term DX (Developer Experience) gets thrown around a lot now. The thing is, good DX isn't just some whiz-bang _ooo, that's cool_ reaction to a new blog post. It's \"how well will this work for me and my team over the next several years??!\" In that sense, the DX of the JavaScript ecosystem has a _lot_ to answer for. Sometimes you even see it in GitHub issue and PR comments: rude, curt dismissals of genuine problems people are having in the real world. RTFM is *never* the correct response to DX issues.\n\nAgain, I come from the world of Ruby—not perfect by any means. But we have a saying, MINASWAN, which stands for Matz-is-nice-and-so-we-are-nice. In other words, the creator of Ruby (known as Matz) is in most respects a pretty genteel fellow. So let's also be nice and help out our fellow developers, particularly the newbies. That doesn't just mean in terms of sharing ideas or providing education. It means _the tools we build should themselves be pretty nice!_ Crappy code smell and lousy DX often gets called out in the Ruby community because we've been handed a high bar. Name your variables well. Reduce boilerplate. Use a small surface area for your API whenever possible. Cultivate well-organized codebases. Convention over configuration. Maximize programmer happiness. And so on and so forth.\n\nThe result of all this is I sometimes look at the bugs or issues with I deal with when using JavaScript tooling and my initial reaction is: **this would _never_ fly in Ruby**. Developers would simply laugh and quickly move on to a better tool. I'm not saying this to prop up Ruby. I'm saying this to convince you that _you need to demand more of your JS tools_.\n\n**Demand more stability.**\n\n**Demand more clarity.**\n\n**Demand more honesty and less marketing fluff.**\n\n**Demand higher standards.** (Heck, demand standards at all! The ecosystem churn around ES modules right now is driving even the top authors of frontend bundlers absolutely nuts!)\n\n**Stop putting up with the nonsense.** The excuses have run out. How long have we had Node? How long has ES6+ JavaScript been with us? How long have we had other, more stable ecosystems to be inspired by?\n\n### Conclusion\n\nYou might conclude, after such a rant, that I hate JavaScript and just want to leave. Actually, I don't! 😅 There are JS projects I _love_ which offer great APIs in my opinion. [LitElement](https://lit-element.polymer-project.org) for example is one of the best developer tools I've ever used in any language. Native ESM support in browsers and modern CDNs like SkyPack are wildly exciting. I've actually written a Webpack plugin and found the experience enjoyable. In fact, unlike some fellow Rails devs I know, I rather like configuring Webpack. (Now who's the crazy one?!) PostCSS is a nifty Node project I benefit from every day. [Shoelace web components](https://shoelace.style) are the bees' knees.\n\nSo I don't hate JS. I don't hate frontend engineering, and I don't hate Node. What I hate is developer tools with awful DX due to hacks upon hacks upon endless modules of widely-varying quality as a result of constant churn in \"best practices\" and what's compatible with what, where, when. I simply no longer have the patience to deal.\n\nThus I'm begging you—_imploring you_—if you build or maintain any tool in the JS ecosystem, pause for a moment and consider how you can reorient yourself around upping the long-term quality level of the tools you produce. And if you are a newbie, DEMAND your tools give you the quality you deserve. And if you _do_ work on a tool that's actually pretty stable, fun to work with, and hasn't tried to take over the world with ridiculous claims—_kudos to you!_ **You're breathing rarified air.** 😜","user":{"name":"Jared White","username":"jaredcwhite","twitter_username":"jaredcwhite","github_username":"jaredcwhite","website_url":"https://www.bridgetownrb.com","profile_image":"https://res.cloudinary.com/practicaldev/image/fetch/s--80J3wLB7--/c_fill,f_auto,fl_progressive,h_640,q_auto,w_640/https://dev-to-uploads.s3.amazonaws.com/uploads/user/profile_image/342525/21d42783-97b3-41d1-a778-d30c3120690a.jpg","profile_image_90":"https://res.cloudinary.com/practicaldev/image/fetch/s--bZJq9nCl--/c_fill,f_auto,fl_progressive,h_90,q_auto,w_90/https://dev-to-uploads.s3.amazonaws.com/uploads/user/profile_image/342525/21d42783-97b3-41d1-a778-d30c3120690a.jpg"},"readingTime":"8 min read"}},"__N_SSG":true}